Revit 2027 API
PartialFailureResults Enumeration
 Possible results of the partial failure from invoking the DesignToFabricationConverter.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PartialFailureResults
Public Enumeration PartialFailureResults
public enum class PartialFailureResults
type PartialFailureResults
Members
Member name | Value | Description
HaveDifferentOffsets | 3 |  Converted fabrication parts have different offsets.
HaveOpenConnectors | 2 |  Converted fabrication parts have open ends.
InvalidConnections | 1 |  The connections are invalid.
NoMatchingSize | 4 |  There are no matching sizes found.
NotAllPartsConverted | 0 |  Not all design elements were converted.
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace